#+TITLE: K8s Reg Asn Magic
#+PROPERTY: header-args:sql-mode+ :eval never-export :exports both :session none

Login to gcloud
#+BEGIN_SRC tmate :window prepare
gcloud auth login
#+END_SRC

Set the project
#+BEGIN_SRC tmate :window prepare
gcloud config set project k8s-infra-ii-sandbox
#+END_SRC

** Post process org blocks
#+NAME: json-res
#+BEGIN_SRC sql-mode :var json-r=""
select data from peeringdb.ixlan limit 1;
#+END_SRC

#+RESULTS: json-res
#+begin_SRC example
 {"id": 41, "mtu": null, "name": "", "descr": "", "ix_id": 41, "rs_asn": 0, "status": "ok", "created": "2010-07-29T00:00:00Z", "updated": "2016-03-11T07:21:58Z", "arp_sponge": null, "dot1q_support": false, "ixf_ixp_member_list_url_visible": "Private"}

#+end_SRC

Dang it I am missing something here....
#+BEGIN_SRC shell :process_r yes :post json-res[:process_r yes](*this*)
jq '.'
#+END_SRC

#+RESULTS:
#+begin_example
 {"id": 41, "mtu": null, "name": "", "descr": "", "ix_id": 41, "rs_asn": 0, "status": "ok", "created": "2010-07-29T00:00:00Z", "updated": "2016-03-11T07:21:58Z", "arp_sponge": null, "dot1q_support": false, "ixf_ixp_member_list_url_visible": "Private"}
#+end_example

** Wrap header
#+BEGIN_SRC sql-mode :results sql :wrap EXPORT json
select data from peeringdb.ixlan limit 1;
#+END_SRC

#+RESULTS:
#+begin_EXPORT json
 {"id": 41, "mtu": null, "name": "", "descr": "", "ix_id": 41, "rs_asn": 0, "status": "ok", "created": "2010-07-29T00:00:00Z", "updated": "2016-03-11T07:21:58Z", "arp_sponge": null, "dot1q_support": false, "ixf_ixp_member_list_url_visible": "Private"}

#+end_EXPORT


